benchmarks/wrk2_lua_scripts/hotel_user/optimized/200
Running 10s test @ http://pc70.cloudlab.umass.edu:8080/r/hotel/user
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.55ms    6.44ms  76.29ms   91.50%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.53ms
 75.000%   14.61ms
 90.000%   19.76ms
 99.000%   40.26ms
 99.900%   70.72ms
 99.990%   76.35ms
 99.999%   76.35ms
100.000%   76.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.071     0.000000            1         1.00
      11.095     0.100000          200         1.11
      11.399     0.200000          401         1.25
      11.711     0.300000          603         1.43
      12.015     0.400000          802         1.67
      12.527     0.500000         1003         2.00
      12.863     0.550000         1102         2.22
      13.215     0.600000         1200         2.50
      13.623     0.650000         1300         2.86
      14.031     0.700000         1400         3.33
      14.607     0.750000         1501         4.00
      15.047     0.775000         1550         4.44
      15.583     0.800000         1600         5.00
      16.087     0.825000         1651         5.71
      17.087     0.850000         1700         6.67
      18.479     0.875000         1751         8.00
      18.927     0.887500         1775         8.89
      19.759     0.900000         1800        10.00
      20.751     0.912500         1825        11.43
      21.791     0.925000         1851        13.33
      23.567     0.937500         1875        16.00
      24.607     0.943750         1888        17.78
      25.583     0.950000         1900        20.00
      26.607     0.956250         1913        22.86
      27.439     0.962500         1925        26.67
      28.655     0.968750         1938        32.00
      29.343     0.971875         1944        35.56
      31.119     0.975000         1950        40.00
      32.159     0.978125         1957        45.71
      32.623     0.981250         1963        53.33
      36.799     0.984375         1969        64.00
      37.087     0.985938         1972        71.11
      37.343     0.987500         1975        80.00
      38.975     0.989062         1979        91.43
      42.527     0.990625         1982       106.67
      53.087     0.992188         1985       128.00
      53.151     0.992969         1986       142.22
      55.839     0.993750         1988       160.00
      60.191     0.994531         1990       182.86
      63.327     0.995313         1991       213.33
      65.727     0.996094         1993       256.00
      65.727     0.996484         1993       284.44
      65.791     0.996875         1994       320.00
      66.303     0.997266         1995       365.71
      66.367     0.997656         1996       426.67
      70.655     0.998047         1997       512.00
      70.655     0.998242         1997       568.89
      70.655     0.998437         1997       640.00
      70.719     0.998633         1998       731.43
      70.719     0.998828         1998       853.33
      76.287     0.999023         1999      1024.00
      76.287     0.999121         1999      1137.78
      76.287     0.999219         1999      1280.00
      76.287     0.999316         1999      1462.86
      76.287     0.999414         1999      1706.67
      76.351     0.999512         2000      2048.00
      76.351     1.000000         2000          inf
#[Mean    =       14.547, StdDeviation   =        6.436]
#[Max     =       76.288, Total count    =         2000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2004 requests in 10.02s, 399.23KB read
Requests/sec:    199.97
Transfer/sec:     39.84KB