benchmarks/wrk2_lua_scripts/hotel_user/optimized/300
Running 10s test @ http://pc70.cloudlab.umass.edu:8080/r/hotel/user
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.06ms    8.43ms 102.46ms   91.66%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.43ms
 75.000%   14.50ms
 90.000%   21.93ms
 99.000%   50.72ms
 99.900%   96.83ms
 99.990%  102.53ms
 99.999%  102.53ms
100.000%  102.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.823     0.000000            1         1.00
      11.047     0.100000          300         1.11
      11.407     0.200000          602         1.25
      11.703     0.300000          905         1.43
      12.039     0.400000         1204         1.67
      12.431     0.500000         1501         2.00
      12.735     0.550000         1654         2.22
      13.047     0.600000         1800         2.50
      13.407     0.650000         1952         2.86
      13.831     0.700000         2100         3.33
      14.519     0.750000         2250         4.00
      15.103     0.775000         2326         4.44
      15.783     0.800000         2400         5.00
      16.687     0.825000         2476         5.71
      18.191     0.850000         2550         6.67
      19.599     0.875000         2626         8.00
      20.591     0.887500         2662         8.89
      21.967     0.900000         2700        10.00
      23.215     0.912500         2737        11.43
      24.127     0.925000         2775        13.33
      25.935     0.937500         2813        16.00
      26.879     0.943750         2831        17.78
      28.079     0.950000         2850        20.00
      29.311     0.956250         2868        22.86
      30.543     0.962500         2887        26.67
      32.703     0.968750         2906        32.00
      34.143     0.971875         2915        35.56
      35.423     0.975000         2925        40.00
      37.983     0.978125         2934        45.71
      39.167     0.981250         2943        53.33
      43.007     0.984375         2953        64.00
      44.543     0.985938         2957        71.11
      45.535     0.987500         2962        80.00
      49.759     0.989062         2967        91.43
      53.375     0.990625         2971       106.67
      65.599     0.992188         2977       128.00
      67.519     0.992969         2978       142.22
      73.087     0.993750         2981       160.00
      75.583     0.994531         2983       182.86
      77.759     0.995313         2985       213.33
      82.303     0.996094         2988       256.00
      82.367     0.996484         2989       284.44
      86.655     0.996875         2990       320.00
      87.615     0.997266         2991       365.71
      87.935     0.997656         2992       426.67
      92.159     0.998047         2994       512.00
      92.159     0.998242         2994       568.89
      92.287     0.998437         2995       640.00
      92.287     0.998633         2995       731.43
      96.831     0.998828         2996       853.33
      96.895     0.999023         2997      1024.00
      96.895     0.999121         2997      1137.78
      96.895     0.999219         2997      1280.00
      96.895     0.999316         2997      1462.86
     102.463     0.999414         2998      1706.67
     102.463     0.999512         2998      2048.00
     102.463     0.999561         2998      2275.56
     102.463     0.999609         2998      2560.00
     102.463     0.999658         2998      2925.71
     102.527     0.999707         2999      3413.33
     102.527     1.000000         2999          inf
#[Mean    =       15.063, StdDeviation   =        8.434]
#[Max     =      102.464, Total count    =         2999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3001 requests in 10.01s, 597.86KB read
Requests/sec:    299.71
Transfer/sec:     59.71KB