benchmarks/wrk2_lua_scripts/hotel_user/optimized/400
Running 10s test @ http://pc70.cloudlab.umass.edu:8080/r/hotel/user
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.53ms   13.86ms 249.47ms   98.07%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.62ms
 75.000%   12.72ms
 90.000%   14.70ms
 99.000%   45.50ms
 99.900%  222.85ms
 99.990%  249.60ms
 99.999%  249.60ms
100.000%  249.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.391     0.000000            1         1.00
      10.591     0.100000          401         1.11
      10.887     0.200000          801         1.25
      11.135     0.300000         1209         1.43
      11.351     0.400000         1606         1.67
      11.623     0.500000         2001         2.00
      11.783     0.550000         2198         2.22
      11.959     0.600000         2403         2.50
      12.175     0.650000         2604         2.86
      12.431     0.700000         2798         3.33
      12.719     0.750000         3000         4.00
      12.911     0.775000         3097         4.44
      13.103     0.800000         3199         5.00
      13.351     0.825000         3297         5.71
      13.679     0.850000         3397         6.67
      14.151     0.875000         3498         8.00
      14.415     0.887500         3547         8.89
      14.719     0.900000         3598        10.00
      15.047     0.912500         3648        11.43
      15.391     0.925000         3699        13.33
      16.039     0.937500         3748        16.00
      16.415     0.943750         3772        17.78
      17.167     0.950000         3797        20.00
      17.791     0.956250         3822        22.86
      18.895     0.962500         3848        26.67
      19.983     0.968750         3872        32.00
      20.607     0.971875         3884        35.56
      22.511     0.975000         3897        40.00
      23.679     0.978125         3909        45.71
      28.031     0.981250         3922        53.33
      30.879     0.984375         3934        64.00
      33.919     0.985938         3940        71.11
      40.511     0.987500         3947        80.00
      43.359     0.989062         3953        91.43
      45.983     0.990625         3959       106.67
      54.751     0.992188         3965       128.00
      59.231     0.992969         3968       142.22
      86.399     0.993750         3972       160.00
     117.119     0.994531         3975       182.86
     132.479     0.995313         3978       213.33
     158.719     0.996094         3981       256.00
     158.847     0.996484         3982       284.44
     171.775     0.996875         3984       320.00
     186.623     0.997266         3986       365.71
     195.199     0.997656         3987       426.67
     209.791     0.998047         3989       512.00
     209.791     0.998242         3989       568.89
     209.919     0.998437         3990       640.00
     222.719     0.998633         3991       731.43
     222.847     0.998828         3992       853.33
     236.031     0.999023         3993      1024.00
     236.031     0.999121         3993      1137.78
     236.031     0.999219         3993      1280.00
     236.159     0.999316         3994      1462.86
     236.159     0.999414         3994      1706.67
     249.471     0.999512         3995      2048.00
     249.471     0.999561         3995      2275.56
     249.471     0.999609         3995      2560.00
     249.471     0.999658         3995      2925.71
     249.471     0.999707         3995      3413.33
     249.599     0.999756         3996      4096.00
     249.599     1.000000         3996          inf
#[Mean    =       13.532, StdDeviation   =       13.859]
#[Max     =      249.472, Total count    =         3996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3998 requests in 10.00s, 796.48KB read
Requests/sec:    399.71
Transfer/sec:     79.63KB